una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g20.h
#define AT91C_US5_CR    ((AT91_REG *) 	0xFFFD8000) /* (US5) Control Register*/
#define AT91C_US5_IER   ((AT91_REG *) 	0xFFFD8008) /* (US5) Interrupt Enable Register*/
/* ========== Register definition for PDC_SSC0 peripheral ========== */
#define AT91C_SSC0_TNPR ((AT91_REG *) 	0xFFFBC118) /* (PDC_SSC0) Transmit Next Pointer Register*/
#define AT91C_SSC0_TCR  ((AT91_REG *) 	0xFFFBC10C) /* (PDC_SSC0) Transmit Counter Register*/
#define AT91C_SSC0_RNCR ((AT91_REG *) 	0xFFFBC114) /* (PDC_SSC0) Receive Next Counter Register*/
#define AT91C_SSC0_RPR  ((AT91_REG *) 	0xFFFBC100) /* (PDC_SSC0) Receive Pointer Register*/
#define AT91C_SSC0_TPR  ((AT91_REG *) 	0xFFFBC108) /* (PDC_SSC0) Transmit Pointer Register*/
#define AT91C_SSC0_RCR  ((AT91_REG *) 	0xFFFBC104) /* (PDC_SSC0) Receive Counter Register*/
#define AT91C_SSC0_RNPR ((AT91_REG *) 	0xFFFBC110) /* (PDC_SSC0) Receive Next Pointer Register*/
#define AT91C_SSC0_PTCR ((AT91_REG *) 	0xFFFBC120) /* (PDC_SSC0) PDC Transfer Control Register*/
#define AT91C_SSC0_TNCR ((AT91_REG *) 	0xFFFBC11C) /* (PDC_SSC0) Transmit Next Counter Register*/
#define AT91C_SSC0_PTSR ((AT91_REG *) 	0xFFFBC124) /* (PDC_SSC0) PDC Transfer Status Register*/
/* ========== Register definition for SSC0 peripheral ========== */
#define AT91C_SSC0_IMR  ((AT91_REG *) 	0xFFFBC04C) /* (SSC0) Interrupt Mask Register*/
#define AT91C_SSC0_RFMR ((AT91_REG *) 	0xFFFBC014) /* (SSC0) Receive Frame Mode Register*/
#define AT91C_SSC0_CR   ((AT91_REG *) 	0xFFFBC000) /* (SSC0) Control Register*/
#define AT91C_SSC0_TFMR ((AT91_REG *) 	0xFFFBC01C) /* (SSC0) Transmit Frame Mode Register*/
#define AT91C_SSC0_CMR  ((AT91_REG *) 	0xFFFBC004) /* (SSC0) Clock Mode Register*/
#define AT91C_SSC0_IER  ((AT91_REG *) 	0xFFFBC044) /* (SSC0) Interrupt Enable Register*/
#define AT91C_SSC0_RHR  ((AT91_REG *) 	0xFFFBC020) /* (SSC0) Receive Holding Register*/
#define AT91C_SSC0_RCMR ((AT91_REG *) 	0xFFFBC010) /* (SSC0) Receive Clock ModeRegister*/
#define AT91C_SSC0_SR   ((AT91_REG *) 	0xFFFBC040) /* (SSC0) Status Register*/
#define AT91C_SSC0_RSHR ((AT91_REG *) 	0xFFFBC030) /* (SSC0) Receive Sync Holding Register*/
#define AT91C_SSC0_THR  ((AT91_REG *) 	0xFFFBC024) /* (SSC0) Transmit Holding Register*/
#define AT91C_SSC0_TCMR ((AT91_REG *) 	0xFFFBC018) /* (SSC0) Transmit Clock Mode Register*/
#define AT91C_SSC0_IDR  ((AT91_REG *) 	0xFFFBC048) /* (SSC0) Interrupt Disable Register*/
#define AT91C_SSC0_TSHR ((AT91_REG *) 	0xFFFBC034) /* (SSC0) Transmit Sync Holding Register*/
/* ========== Register definition for PDC_SPI0 peripheral ========== */
#define AT91C_SPI0_PTCR ((AT91_REG *) 	0xFFFC8120) /* (PDC_SPI0) PDC Transfer Control Register*/
#define AT91C_SPI0_TCR  ((AT91_REG *) 	0xFFFC810C) /* (PDC_SPI0) Transmit Counter Register*/
#define AT91C_SPI0_RPR  ((AT91_REG *) 	0xFFFC8100) /* (PDC_SPI0) Receive Pointer Register*/
#define AT91C_SPI0_TPR  ((AT91_REG *) 	0xFFFC8108) /* (PDC_SPI0) Transmit Pointer Register*/
#define AT91C_SPI0_PTSR ((AT91_REG *) 	0xFFFC8124) /* (PDC_SPI0) PDC Transfer Status Register*/
#define AT91C_SPI0_RNCR ((AT91_REG *) 	0xFFFC8114) /* (PDC_SPI0) Receive Next Counter Register*/
#define AT91C_SPI0_TNPR ((AT91_REG *) 	0xFFFC8118) /* (PDC_SPI0) Transmit Next Pointer Register*/
#define AT91C_SPI0_RCR  ((AT91_REG *) 	0xFFFC8104) /* (PDC_SPI0) Receive Counter Register*/
#define AT91C_SPI0_RNPR ((AT91_REG *) 	0xFFFC8110) /* (PDC_SPI0) Receive Next Pointer Register*/
#define AT91C_SPI0_TNCR ((AT91_REG *) 	0xFFFC811C) /* (PDC_SPI0) Transmit Next Counter Register*/
/* ========== Register definition for SPI0 peripheral ========== */
#define AT91C_SPI0_IDR  ((AT91_REG *) 	0xFFFC8018) /* (SPI0) Interrupt Disable Register*/
#define AT91C_SPI0_TDR  ((AT91_REG *) 	0xFFFC800C) /* (SPI0) Transmit Data Register*/
#define AT91C_SPI0_SR   ((AT91_REG *) 	0xFFFC8010) /* (SPI0) Status Register*/
#define AT91C_SPI0_CR   ((AT91_REG *) 	0xFFFC8000) /* (SPI0) Control Register*/
#define AT91C_SPI0_CSR  ((AT91_REG *) 	0xFFFC8030) /* (SPI0) Chip Select Register*/
#define AT91C_SPI0_RDR  ((AT91_REG *) 	0xFFFC8008) /* (SPI0) Receive Data Register*/
#define AT91C_SPI0_MR   ((AT91_REG *) 	0xFFFC8004) /* (SPI0) Mode Register*/
#define AT91C_SPI0_IER  ((AT91_REG *) 	0xFFFC8014) /* (SPI0) Interrupt Enable Register*/
#define AT91C_SPI0_IMR  ((AT91_REG *) 	0xFFFC801C) /* (SPI0) Interrupt Mask Register*/
/* ========== Register definition for PDC_SPI1 peripheral ========== */
#define AT91C_SPI1_PTCR ((AT91_REG *) 	0xFFFCC120) /* (PDC_SPI1) PDC Transfer Control Register*/
#define AT91C_SPI1_RNPR ((AT91_REG *) 	0xFFFCC110) /* (PDC_SPI1) Receive Next Pointer Register*/
#define AT91C_SPI1_RCR  ((AT91_REG *) 	0xFFFCC104) /* (PDC_SPI1) Receive Counter Register*/
#define AT91C_SPI1_TPR  ((AT91_REG *) 	0xFFFCC108) /* (PDC_SPI1) Transmit Pointer Register*/
#define AT91C_SPI1_PTSR ((AT91_REG *) 	0xFFFCC124) /* (PDC_SPI1) PDC Transfer Status Register*/
#define AT91C_SPI1_TNCR ((AT91_REG *) 	0xFFFCC11C) /* (PDC_SPI1) Transmit Next Counter Register*/
#define AT91C_SPI1_RPR  ((AT91_REG *) 	0xFFFCC100) /* (PDC_SPI1) Receive Pointer Register*/
#define AT91C_SPI1_TCR  ((AT91_REG *) 	0xFFFCC10C) /* (PDC_SPI1) Transmit Counter Register*/
#define AT91C_SPI1_RNCR ((AT91_REG *) 	0xFFFCC114) /* (PDC_SPI1) Receive Next Counter Register*/
#define AT91C_SPI1_TNPR ((AT91_REG *) 	0xFFFCC118) /* (PDC_SPI1) Transmit Next Pointer Register*/
/* ========== Register definition for SPI1 peripheral ========== */
#define AT91C_SPI1_IER  ((AT91_REG *) 	0xFFFCC014) /* (SPI1) Interrupt Enable Register*/
#define AT91C_SPI1_RDR  ((AT91_REG *) 	0xFFFCC008) /* (SPI1) Receive Data Register*/
#define AT91C_SPI1_SR   ((AT91_REG *) 	0xFFFCC010) /* (SPI1) Status Register*/
#define AT91C_SPI1_IMR  ((AT91_REG *) 	0xFFFCC01C) /* (SPI1) Interrupt Mask Register*/
#define AT91C_SPI1_TDR  ((AT91_REG *) 	0xFFFCC00C) /* (SPI1) Transmit Data Register*/
#define AT91C_SPI1_IDR  ((AT91_REG *) 	0xFFFCC018) /* (SPI1) Interrupt Disable Register*/
#define AT91C_SPI1_CSR  ((AT91_REG *) 	0xFFFCC030) /* (SPI1) Chip Select Register*/
#define AT91C_SPI1_CR   ((AT91_REG *) 	0xFFFCC000) /* (SPI1) Control Register*/
#define AT91C_SPI1_MR   ((AT91_REG *) 	0xFFFCC004) /* (SPI1) Mode Register*/
/* ========== Register definition for PDC_ADC peripheral ========== */
#define AT91C_ADC_PTCR  ((AT91_REG *) 	0xFFFE0120) /* (PDC_ADC) PDC Transfer Control Register*/
#define AT91C_ADC_TPR   ((AT91_REG *) 	0xFFFE0108) /* (PDC_ADC) Transmit Pointer Register*/
#define AT91C_ADC_TCR   ((AT91_REG *) 	0xFFFE010C) /* (PDC_ADC) Transmit Counter Register*/
#define AT91C_ADC_RCR   ((AT91_REG *) 	0xFFFE0104) /* (PDC_ADC) Receive Counter Register*/
#define AT91C_ADC_PTSR  ((AT91_REG *) 	0xFFFE0124) /* (PDC_ADC) PDC Transfer Status Register*/
#define AT91C_ADC_RNPR  ((AT91_REG *) 	0xFFFE0110) /* (PDC_ADC) Receive Next Pointer Register*/
#define AT91C_ADC_RPR   ((AT91_REG *) 	0xFFFE0100) /* (PDC_ADC) Receive Pointer Register*/
#define AT91C_ADC_TNCR  ((AT91_REG *) 	0xFFFE011C) /* (PDC_ADC) Transmit Next Counter Register*/
#define AT91C_ADC_RNCR  ((AT91_REG *) 	0xFFFE0114) /* (PDC_ADC) Receive Next Counter Register*/
#define AT91C_ADC_TNPR  ((AT91_REG *) 	0xFFFE0118) /* (PDC_ADC) Transmit Next Pointer Register*/
/* ========== Register definition for ADC peripheral ========== */
#define AT91C_ADC_CHDR  ((AT91_REG *) 	0xFFFE0014) /* (ADC) ADC Channel Disable Register*/
#define AT91C_ADC_CDR3  ((AT91_REG *) 	0xFFFE003C) /* (ADC) ADC Channel Data Register 3*/
#define AT91C_ADC_CHER  ((AT91_REG *) 	0xFFFE0010) /* (ADC) ADC Channel Enable Register*/
#define AT91C_ADC_CHSR  ((AT91_REG *) 	0xFFFE0018) /* (ADC) ADC Channel Status Register*/
#define AT91C_ADC_CR    ((AT91_REG *) 	0xFFFE0000) /* (ADC) ADC Control Register*/
#define AT91C_ADC_IMR   ((AT91_REG *) 	0xFFFE002C) /* (ADC) ADC Interrupt Mask Register*/
#define AT91C_ADC_MR    ((AT91_REG *) 	0xFFFE0004) /* (ADC) ADC Mode Register*/
#define AT91C_ADC_CDR2  ((AT91_REG *) 	0xFFFE0038) /* (ADC) ADC Channel Data Register 2*/
#define AT91C_ADC_SR    ((AT91_REG *) 	0xFFFE001C) /* (ADC) ADC Status Register*/
#define AT91C_ADC_LCDR  ((AT91_REG *) 	0xFFFE0020) /* (ADC) ADC Last Converted Data Register*/
#define AT91C_ADC_IER   ((AT91_REG *) 	0xFFFE0024) /* (ADC) ADC Interrupt Enable Register*/
#define AT91C_ADC_CDR1  ((AT91_REG *) 	0xFFFE0034) /* (ADC) ADC Channel Data Register 1*/
#define AT91C_ADC_IDR   ((AT91_REG *) 	0xFFFE0028) /* (ADC) ADC Interrupt Disable Register*/
#define AT91C_ADC_CDR0  ((AT91_REG *) 	0xFFFE0030) /* (ADC) ADC Channel Data Register 0*/
/* ========== Register definition for EMACB peripheral ========== */
#define AT91C_EMACB_USRIO ((AT91_REG *) 	0xFFFC40C0) /* (EMACB) USER Input/Output Register*/
#define AT91C_EMACB_RSE ((AT91_REG *) 	0xFFFC4074) /* (EMACB) Receive Symbol Errors Register*/
#define AT91C_EMACB_SCF ((AT91_REG *) 	0xFFFC4044) /* (EMACB) Single Collision Frame Register*/
#define AT91C_EMACB_STE ((AT91_REG *) 	0xFFFC4084) /* (EMACB) SQE Test Error Register*/
#define AT91C_EMACB_SA1H ((AT91_REG *) 	0xFFFC409C) /* (EMACB) Specific Address 1 Top, Last 2 bytes*/
#define AT91C_EMACB_ROV ((AT91_REG *) 	0xFFFC4070) /* (EMACB) Receive Overrun Errors Register*/
#define AT91C_EMACB_TBQP ((AT91_REG *) 	0xFFFC401C) /* (EMACB) Transmit Buffer Queue Pointer*/
#define AT91C_EMACB_IMR ((AT91_REG *) 	0xFFFC4030) /* (EMACB) Interrupt Mask Register*/
#define AT91C_EMACB_IER ((AT91_REG *) 	0xFFFC4028) /* (EMACB) Interrupt Enable Register*/
#define AT91C_EMACB_REV ((AT91_REG *) 	0xFFFC40FC) /* (EMACB) Revision Register*/
#define AT91C_EMACB_SA3L ((AT91_REG *) 	0xFFFC40A8) /* (EMACB) Specific Address 3 Bottom, First 4 bytes*/
#define AT91C_EMACB_ELE ((AT91_REG *) 	0xFFFC4078) /* (EMACB) Excessive Length Errors Register*/
#define AT91C_EMACB_HRT ((AT91_REG *) 	0xFFFC4094) /* (EMACB) Hash Address Top[63:32]*/
#define AT91C_EMACB_SA2L ((AT91_REG *) 	0xFFFC40A0) /* (EMACB) Specific Address 2 Bottom, First 4 bytes*/
#define AT91C_EMACB_RRE ((AT91_REG *) 	0xFFFC406C) /* (EMACB) Receive Ressource Error Register*/
#define AT91C_EMACB_FRO ((AT91_REG *) 	0xFFFC404C) /* (EMACB) Frames Received OK Register*/
#define AT91C_EMACB_TPQ ((AT91_REG *) 	0xFFFC40BC) /* (EMACB) Transmit Pause Quantum Register*/
#define AT91C_EMACB_ISR ((AT91_REG *) 	0xFFFC4024) /* (EMACB) Interrupt Status Register*/
#define AT91C_EMACB_TSR ((AT91_REG *) 	0xFFFC4014) /* (EMACB) Transmit Status Register*/
#define AT91C_EMACB_RLE ((AT91_REG *) 	0xFFFC4088) /* (EMACB) Receive Length Field Mismatch Register*/
#define AT91C_EMACB_USF ((AT91_REG *) 	0xFFFC4080) /* (EMACB) Undersize Frames Register*/
#define AT91C_EMACB_WOL ((AT91_REG *) 	0xFFFC40C4) /* (EMACB) Wake On LAN Register*/
#define AT91C_EMACB_TPF ((AT91_REG *) 	0xFFFC408C) /* (EMACB) Transmitted Pause Frames Register*/
#define AT91C_EMACB_PTR ((AT91_REG *) 	0xFFFC4038) /* (EMACB) Pause Time Register*/
#define AT91C_EMACB_TUND ((AT91_REG *) 	0xFFFC4064) /* (EMACB) Transmit Underrun Error Register*/
#define AT91C_EMACB_MAN ((AT91_REG *) 	0xFFFC4034) /* (EMACB) PHY Maintenance Register*/
#define AT91C_EMACB_RJA ((AT91_REG *) 	0xFFFC407C) /* (EMACB) Receive Jabbers Register*/
#define AT91C_EMACB_SA4L ((AT91_REG *) 	0xFFFC40B0) /* (EMACB) Specific Address 4 Bottom, First 4 bytes*/
#define AT91C_EMACB_CSE ((AT91_REG *) 	0xFFFC4068) /* (EMACB) Carrier Sense Error Register*/
#define AT91C_EMACB_HRB ((AT91_REG *) 	0xFFFC4090) /* (EMACB) Hash Address Bottom[31:0]*/
#define AT91C_EMACB_ALE ((AT91_REG *) 	0xFFFC4054) /* (EMACB) Alignment Error Register*/
#define AT91C_EMACB_SA1L ((AT91_REG *) 	0xFFFC4098) /* (EMACB) Specific Address 1 Bottom, First 4 bytes*/
#define AT91C_EMACB_NCR ((AT91_REG *) 	0xFFFC4000) /* (EMACB) Network Control Register*/
#define AT91C_EMACB_FTO ((AT91_REG *) 	0xFFFC4040) /* (EMACB) Frames Transmitted OK Register*/
#define AT91C_EMACB_ECOL ((AT91_REG *) 	0xFFFC4060) /* (EMACB) Excessive Collision Register*/
#define AT91C_EMACB_DTF ((AT91_REG *) 	0xFFFC4058) /* (EMACB) Deferred Transmission Frame Register*/
#define AT91C_EMACB_SA4H ((AT91_REG *) 	0xFFFC40B4) /* (EMACB) Specific Address 4 Top, Last 2 bytes*/
#define AT91C_EMACB_FCSE ((AT91_REG *) 	0xFFFC4050) /* (EMACB) Frame Check Sequence Error Register*/
#define AT91C_EMACB_TID ((AT91_REG *) 	0xFFFC40B8) /* (EMACB) Type ID Checking Register*/
#define AT91C_EMACB_PFR ((AT91_REG *) 	0xFFFC403C) /* (EMACB) Pause Frames received Register*/
#define AT91C_EMACB_IDR ((AT91_REG *) 	0xFFFC402C) /* (EMACB) Interrupt Disable Register*/
#define AT91C_EMACB_SA3H ((AT91_REG *) 	0xFFFC40AC) /* (EMACB) Specific Address 3 Top, Last 2 bytes*/
#define AT91C_EMACB_NSR ((AT91_REG *) 	0xFFFC4008) /* (EMACB) Network Status Register*/
#define AT91C_EMACB_MCF ((AT91_REG *) 	0xFFFC4048) /* (EMACB) Multiple Collision Frame Register*/
#define AT91C_EMACB_RBQP ((AT91_REG *) 	0xFFFC4018) /* (EMACB) Receive Buffer Queue Pointer*/
#define AT91C_EMACB_RSR ((AT91_REG *) 	0xFFFC4020) /* (EMACB) Receive Status Register*/
#define AT91C_EMACB_SA2H ((AT91_REG *) 	0xFFFC40A4) /* (EMACB) Specific Address 2 Top, Last 2 bytes*/
#define AT91C_EMACB_NCFGR ((AT91_REG *) 	0xFFFC4004) /* (EMACB) Network Configuration Register*/
#define AT91C_EMACB_LCOL ((AT91_REG *) 	0xFFFC405C) /* (EMACB) Late Collision Register*/
/* ========== Register definition for UDP peripheral ========== */
#define AT91C_UDP_GLBSTATE ((AT91_REG *) 	0xFFFA4004) /* (UDP) Global State Register*/
#define AT91C_UDP_FDR   ((AT91_REG *) 	0xFFFA4050) /* (UDP) Endpoint FIFO Data Register*/
#define AT91C_UDP_RSTEP ((AT91_REG *) 	0xFFFA4028) /* (UDP) Reset Endpoint Register*/
#define AT91C_UDP_FADDR ((AT91_REG *) 	0xFFFA4008) /* (UDP) Function Address Register*/
#define AT91C_UDP_NUM   ((AT91_REG *) 	0xFFFA4000) /* (UDP) Frame Number Register*/
#define AT91C_UDP_IDR   ((AT91_REG *) 	0xFFFA4014) /* (UDP) Interrupt Disable Register*/
#define AT91C_UDP_IMR   ((AT91_REG *) 	0xFFFA4018) /* (UDP) Interrupt Mask Register*/
#define AT91C_UDP_CSR   ((AT91_REG *) 	0xFFFA4030) /* (UDP) Endpoint Control and Status Register*/
#define AT91C_UDP_IER   ((AT91_REG *) 	0xFFFA4010) /* (UDP) Interrupt Enable Register*/
#define AT91C_UDP_ICR   ((AT91_REG *) 	0xFFFA4020) /* (UDP) Interrupt Clear Register*/
#define AT91C_UDP_TXVC  ((AT91_REG *) 	0xFFFA4074) /* (UDP) Transceiver Control Register*/
#define AT91C_UDP_ISR   ((AT91_REG *) 	0xFFFA401C) /* (UDP) Interrupt Status Register*/
/* ========== Register definition for UHP peripheral ========== */
#define AT91C_UHP_HcInterruptStatus ((AT91_REG *) 	0x0050000C) /* (UHP) Interrupt Status Register*/
#define AT91C_UHP_HcCommandStatus ((AT91_REG *) 	0x00500008) /* (UHP) Command & status Register*/
#define AT91C_UHP_HcRhStatus ((AT91_REG *) 	0x00500050) /* (UHP) Root Hub Status register*/
#define AT91C_UHP_HcInterruptDisable ((AT91_REG *) 	0x00500014) /* (UHP) Interrupt Disable Register*/
#define AT91C_UHP_HcPeriodicStart ((AT91_REG *) 	0x00500040) /* (UHP) Periodic Start*/
#define AT91C_UHP_HcControlCurrentED ((AT91_REG *) 	0x00500024) /* (UHP) Endpoint Control and Status Register*/
#define AT91C_UHP_HcPeriodCurrentED ((AT91_REG *) 	0x0050001C) /* (UHP) Current Isochronous or Interrupt Endpoint Descriptor*/
#define AT91C_UHP_HcBulkHeadED ((AT91_REG *) 	0x00500028) /* (UHP) First endpoint register of the Bulk list*/
#define AT91C_UHP_HcRevision ((AT91_REG *) 	0x00500000) /* (UHP) Revision*/
#define AT91C_UHP_HcBulkCurrentED ((AT91_REG *) 	0x0050002C) /* (UHP) Current endpoint of the Bulk list*/
#define AT91C_UHP_HcRhDescriptorB ((AT91_REG *) 	0x0050004C) /* (UHP) Root Hub characteristics B*/
#define AT91C_UHP_HcControlHeadED ((AT91_REG *) 	0x00500020) /* (UHP) First Endpoint Descriptor of the Control list*/
#define AT91C_UHP_HcFmRemaining ((AT91_REG *) 	0x00500038) /* (UHP) Bit time remaining in the current Frame*/
#define AT91C_UHP_HcHCCA ((AT91_REG *) 	0x00500018) /* (UHP) Pointer to the Host Controller Communication Area*/
#define AT91C_UHP_HcLSThreshold ((AT91_REG *) 	0x00500044) /* (UHP) LS Threshold*/
#define AT91C_UHP_HcRhPortStatus ((AT91_REG *) 	0x00500054) /* (UHP) Root Hub Port Status Register*/
#define AT91C_UHP_HcInterruptEnable ((AT91_REG *) 	0x00500010) /* (UHP) Interrupt Enable Register*/
#define AT91C_UHP_HcFmNumber ((AT91_REG *) 	0x0050003C) /* (UHP) Frame number*/
#define AT91C_UHP_HcFmInterval ((AT91_REG *) 	0x00500034) /* (UHP) Bit time between 2 consecutive SOFs*/
#define AT91C_UHP_HcControl ((AT91_REG *) 	0x00500004) /* (UHP) Operating modes for the Host Controller*/
#define AT91C_UHP_HcBulkDoneHead ((AT91_REG *) 	0x00500030) /* (UHP) Last completed transfer descriptor*/
#define AT91C_UHP_HcRhDescriptorA ((AT91_REG *) 	0x00500048) /* (UHP) Root Hub characteristics A*/
/* ========== Register definition for HECC peripheral ========== */
/* ========== Register definition for HISI peripheral ========== */
#define AT91C_HISI_PSIZE ((AT91_REG *) 	0xFFFC0020) /* (HISI) Preview Size Register*/
#define AT91C_HISI_CR1  ((AT91_REG *) 	0xFFFC0000) /* (HISI) Control Register 1*/
#define AT91C_HISI_R2YSET1 ((AT91_REG *) 	0xFFFC003C) /* (HISI) Color Space Conversion Register*/
#define AT91C_HISI_CDBA ((AT91_REG *) 	0xFFFC002C) /* (HISI) Codec Dma Address Register*/
#define AT91C_HISI_IDR  ((AT91_REG *) 	0xFFFC0010) /* (HISI) Interrupt Disable Register*/
#define AT91C_HISI_R2YSET2 ((AT91_REG *) 	0xFFFC0040) /* (HISI) Color Space Conversion Register*/
#define AT91C_HISI_Y2RSET1 ((AT91_REG *) 	0xFFFC0034) /* (HISI) Color Space Conversion Register*/
#define AT91C_HISI_PFBD ((AT91_REG *) 	0xFFFC0028) /* (HISI) Preview Frame Buffer Address Register*/
#define AT91C_HISI_CR2  ((AT91_REG *) 	0xFFFC0004) /* (HISI) Control Register 2*/
#define AT91C_HISI_Y2RSET0 ((AT91_REG *) 	0xFFFC0030) /* (HISI) Color Space Conversion Register*/
#define AT91C_HISI_PDECF ((AT91_REG *) 	0xFFFC0024) /* (HISI) Preview Decimation Factor Register*/
#define AT91C_HISI_IMR  ((AT91_REG *) 	0xFFFC0014) /* (HISI) Interrupt Mask Register*/
#define AT91C_HISI_IER  ((AT91_REG *) 	0xFFFC000C) /* (HISI) Interrupt Enable Register*/
#define AT91C_HISI_R2YSET0 ((AT91_REG *) 	0xFFFC0038) /* (HISI) Color Space Conversion Register*/
#define AT91C_HISI_SR   ((AT91_REG *) 	0xFFFC0008) /* (HISI) Status Register*/

