una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g20.h
/* - ******************************************************************************/
/* -               PIO DEFINITIONS FOR AT91SAM9260A*/
/* - ******************************************************************************/
AT91C_PIO_PA0             EQU (1 <<  0) ;- Pin Controlled by PA0
AT91C_PA0_SPI0_MISO       EQU (AT91C_PIO_PA0) ;-  SPI 0 Master In Slave
AT91C_PA0_MCDB0           EQU (AT91C_PIO_PA0) ;-  Multimedia Card B Data 0
AT91C_PIO_PA1             EQU (1 <<  1) ;- Pin Controlled by PA1
AT91C_PA1_SPI0_MOSI       EQU (AT91C_PIO_PA1) ;-  SPI 0 Master Out Slave
AT91C_PA1_MCCDB           EQU (AT91C_PIO_PA1) ;-  Multimedia Card B Command
AT91C_PIO_PA10            EQU (1 << 10) ;- Pin Controlled by PA10
AT91C_PA10_MCDA2          EQU (AT91C_PIO_PA10) ;-  Multimedia Card A Data 2
AT91C_PA10_ETX2_0         EQU (AT91C_PIO_PA10) ;-  Ethernet MAC Transmit Data 2
AT91C_PIO_PA11            EQU (1 << 11) ;- Pin Controlled by PA11
AT91C_PA11_MCDA3          EQU (AT91C_PIO_PA11) ;-  Multimedia Card A Data 3
AT91C_PA11_ETX3_0         EQU (AT91C_PIO_PA11) ;-  Ethernet MAC Transmit Data 3
AT91C_PIO_PA12            EQU (1 << 12) ;- Pin Controlled by PA12
AT91C_PA12_ETX0           EQU (AT91C_PIO_PA12) ;-  Ethernet MAC Transmit Data 0
AT91C_PIO_PA13            EQU (1 << 13) ;- Pin Controlled by PA13
AT91C_PA13_ETX1           EQU (AT91C_PIO_PA13) ;-  Ethernet MAC Transmit Data 1
AT91C_PIO_PA14            EQU (1 << 14) ;- Pin Controlled by PA14
AT91C_PA14_ERX0           EQU (AT91C_PIO_PA14) ;-  Ethernet MAC Receive Data 0
AT91C_PIO_PA15            EQU (1 << 15) ;- Pin Controlled by PA15
AT91C_PA15_ERX1           EQU (AT91C_PIO_PA15) ;-  Ethernet MAC Receive Data 1
AT91C_PIO_PA16            EQU (1 << 16) ;- Pin Controlled by PA16
AT91C_PA16_ETXEN          EQU (AT91C_PIO_PA16) ;-  Ethernet MAC Transmit Enable
AT91C_PIO_PA17            EQU (1 << 17) ;- Pin Controlled by PA17
AT91C_PA17_ERXDV          EQU (AT91C_PIO_PA17) ;-  Ethernet MAC Receive Data Valid
AT91C_PIO_PA18            EQU (1 << 18) ;- Pin Controlled by PA18
AT91C_PA18_ERXER          EQU (AT91C_PIO_PA18) ;-  Ethernet MAC Receive Error
AT91C_PIO_PA19            EQU (1 << 19) ;- Pin Controlled by PA19
AT91C_PA19_ETXCK          EQU (AT91C_PIO_PA19) ;-  Ethernet MAC Transmit Clock/Reference Clock
AT91C_PIO_PA2             EQU (1 <<  2) ;- Pin Controlled by PA2
AT91C_PA2_SPI0_SPCK       EQU (AT91C_PIO_PA2) ;-  SPI 0 Serial Clock
AT91C_PIO_PA20            EQU (1 << 20) ;- Pin Controlled by PA20
AT91C_PA20_EMDC           EQU (AT91C_PIO_PA20) ;-  Ethernet MAC Management Data Clock
AT91C_PIO_PA21            EQU (1 << 21) ;- Pin Controlled by PA21
AT91C_PA21_EMDIO          EQU (AT91C_PIO_PA21) ;-  Ethernet MAC Management Data Input/Output
AT91C_PIO_PA22            EQU (1 << 22) ;- Pin Controlled by PA22
AT91C_PA22_ADTRG          EQU (AT91C_PIO_PA22) ;-  ADC Trigger
AT91C_PA22_ETXER          EQU (AT91C_PIO_PA22) ;-  Ethernet MAC Transmikt Coding Error
AT91C_PIO_PA23            EQU (1 << 23) ;- Pin Controlled by PA23
AT91C_PA23_TWD            EQU (AT91C_PIO_PA23) ;-  TWI Two-wire Serial Data
AT91C_PA23_ETX2_1         EQU (AT91C_PIO_PA23) ;-  Ethernet MAC Transmit Data 2
AT91C_PIO_PA24            EQU (1 << 24) ;- Pin Controlled by PA24
AT91C_PA24_TWCK           EQU (AT91C_PIO_PA24) ;-  TWI Two-wire Serial Clock
AT91C_PA24_ETX3_1         EQU (AT91C_PIO_PA24) ;-  Ethernet MAC Transmit Data 3
AT91C_PIO_PA25            EQU (1 << 25) ;- Pin Controlled by PA25
AT91C_PA25_TCLK0          EQU (AT91C_PIO_PA25) ;-  Timer Counter 0 external clock input
AT91C_PA25_ERX2           EQU (AT91C_PIO_PA25) ;-  Ethernet MAC Receive Data 2
AT91C_PIO_PA26            EQU (1 << 26) ;- Pin Controlled by PA26
AT91C_PA26_TIOA0          EQU (AT91C_PIO_PA26) ;-  Timer Counter 0 Multipurpose Timer I/O Pin A
AT91C_PA26_ERX3           EQU (AT91C_PIO_PA26) ;-  Ethernet MAC Receive Data 3
AT91C_PIO_PA27            EQU (1 << 27) ;- Pin Controlled by PA27
AT91C_PA27_TIOA1          EQU (AT91C_PIO_PA27) ;-  Timer Counter 1 Multipurpose Timer I/O Pin A
AT91C_PA27_ERXCK          EQU (AT91C_PIO_PA27) ;-  Ethernet MAC Receive Clock
AT91C_PIO_PA28            EQU (1 << 28) ;- Pin Controlled by PA28
AT91C_PA28_TIOA2          EQU (AT91C_PIO_PA28) ;-  Timer Counter 2 Multipurpose Timer I/O Pin A
AT91C_PA28_ECRS           EQU (AT91C_PIO_PA28) ;-  Ethernet MAC Carrier Sense/Carrier Sense and Data Valid
AT91C_PIO_PA29            EQU (1 << 29) ;- Pin Controlled by PA29
AT91C_PA29_SCK1           EQU (AT91C_PIO_PA29) ;-  USART 1 Serial Clock
AT91C_PA29_ECOL           EQU (AT91C_PIO_PA29) ;-  Ethernet MAC Collision Detected
AT91C_PIO_PA3             EQU (1 <<  3) ;- Pin Controlled by PA3
AT91C_PA3_SPI0_NPCS0      EQU (AT91C_PIO_PA3) ;-  SPI 0 Peripheral Chip Select 0
AT91C_PA3_MCDB3           EQU (AT91C_PIO_PA3) ;-  Multimedia Card B Data 3
AT91C_PIO_PA30            EQU (1 << 30) ;- Pin Controlled by PA30
AT91C_PA30_SCK2           EQU (AT91C_PIO_PA30) ;-  USART 2 Serial Clock
AT91C_PA30_RXD4           EQU (AT91C_PIO_PA30) ;-  USART 4 Receive Data
AT91C_PIO_PA31            EQU (1 << 31) ;- Pin Controlled by PA31
AT91C_PA31_SCK0           EQU (AT91C_PIO_PA31) ;-  USART 0 Serial Clock
AT91C_PA31_TXD4           EQU (AT91C_PIO_PA31) ;-  USART 4 Transmit Data
AT91C_PIO_PA4             EQU (1 <<  4) ;- Pin Controlled by PA4
AT91C_PA4_RTS2            EQU (AT91C_PIO_PA4) ;-  USART 2 Ready To Send
AT91C_PA4_MCDB2           EQU (AT91C_PIO_PA4) ;-  Multimedia Card B Data 2
AT91C_PIO_PA5             EQU (1 <<  5) ;- Pin Controlled by PA5
AT91C_PA5_CTS2            EQU (AT91C_PIO_PA5) ;-  USART 2 Clear To Send
AT91C_PA5_MCDB1           EQU (AT91C_PIO_PA5) ;-  Multimedia Card B Data 1
AT91C_PIO_PA6             EQU (1 <<  6) ;- Pin Controlled by PA6
AT91C_PA6_MCDA0           EQU (AT91C_PIO_PA6) ;-  Multimedia Card A Data 0
AT91C_PIO_PA7             EQU (1 <<  7) ;- Pin Controlled by PA7
AT91C_PA7_MCCDA           EQU (AT91C_PIO_PA7) ;-  Multimedia Card A Command
AT91C_PIO_PA8             EQU (1 <<  8) ;- Pin Controlled by PA8
AT91C_PA8_MCCK            EQU (AT91C_PIO_PA8) ;-  Multimedia Card Clock
AT91C_PIO_PA9             EQU (1 <<  9) ;- Pin Controlled by PA9
AT91C_PA9_MCDA1           EQU (AT91C_PIO_PA9) ;-  Multimedia Card A Data 1
AT91C_PIO_PB0             EQU (1 <<  0) ;- Pin Controlled by PB0
AT91C_PB0_SPI1_MISO       EQU (AT91C_PIO_PB0) ;-  SPI 1 Master In Slave
AT91C_PB0_TIOA3           EQU (AT91C_PIO_PB0) ;-  Timer Counter 3 Multipurpose Timer I/O Pin A
AT91C_PIO_PB1             EQU (1 <<  1) ;- Pin Controlled by PB1
AT91C_PB1_SPI1_MOSI       EQU (AT91C_PIO_PB1) ;-  SPI 1 Master Out Slave
AT91C_PB1_TIOB3           EQU (AT91C_PIO_PB1) ;-  Timer Counter 3 Multipurpose Timer I/O Pin B
AT91C_PIO_PB10            EQU (1 << 10) ;- Pin Controlled by PB10
AT91C_PB10_TXD3           EQU (AT91C_PIO_PB10) ;-  USART 3 Transmit Data
AT91C_PB10_ISI_D8         EQU (AT91C_PIO_PB10) ;-  Image Sensor Data 8
AT91C_PIO_PB11            EQU (1 << 11) ;- Pin Controlled by PB11
AT91C_PB11_RXD3           EQU (AT91C_PIO_PB11) ;-  USART 3 Receive Data
AT91C_PB11_ISI_D9         EQU (AT91C_PIO_PB11) ;-  Image Sensor Data 9
AT91C_PIO_PB12            EQU (1 << 12) ;- Pin Controlled by PB12
AT91C_PB12_TXD5           EQU (AT91C_PIO_PB12) ;-  USART 5 Transmit Data
AT91C_PB12_ISI_D10        EQU (AT91C_PIO_PB12) ;-  Image Sensor Data 10
AT91C_PIO_PB13            EQU (1 << 13) ;- Pin Controlled by PB13
AT91C_PB13_RXD5           EQU (AT91C_PIO_PB13) ;-  USART 5 Receive Data
AT91C_PB13_ISI_D11        EQU (AT91C_PIO_PB13) ;-  Image Sensor Data 11
AT91C_PIO_PB14            EQU (1 << 14) ;- Pin Controlled by PB14
AT91C_PB14_DRXD           EQU (AT91C_PIO_PB14) ;-  DBGU Debug Receive Data
AT91C_PIO_PB15            EQU (1 << 15) ;- Pin Controlled by PB15
AT91C_PB15_DTXD           EQU (AT91C_PIO_PB15) ;-  DBGU Debug Transmit Data
AT91C_PIO_PB16            EQU (1 << 16) ;- Pin Controlled by PB16
AT91C_PB16_TK0            EQU (AT91C_PIO_PB16) ;-  SSC0 Transmit Clock
AT91C_PB16_TCLK3          EQU (AT91C_PIO_PB16) ;-  Timer Counter 3 external clock input
AT91C_PIO_PB17            EQU (1 << 17) ;- Pin Controlled by PB17
AT91C_PB17_TF0            EQU (AT91C_PIO_PB17) ;-  SSC0 Transmit Frame Sync
AT91C_PB17_TCLK4          EQU (AT91C_PIO_PB17) ;-  Timer Counter 4 external clock input
AT91C_PIO_PB18            EQU (1 << 18) ;- Pin Controlled by PB18
AT91C_PB18_TD0            EQU (AT91C_PIO_PB18) ;-  SSC0 Transmit data
AT91C_PB18_TIOB4          EQU (AT91C_PIO_PB18) ;-  Timer Counter 4 Multipurpose Timer I/O Pin B
AT91C_PIO_PB19            EQU (1 << 19) ;- Pin Controlled by PB19
AT91C_PB19_RD0            EQU (AT91C_PIO_PB19) ;-  SSC0 Receive Data
AT91C_PB19_TIOB5          EQU (AT91C_PIO_PB19) ;-  Timer Counter 5 Multipurpose Timer I/O Pin B
AT91C_PIO_PB2             EQU (1 <<  2) ;- Pin Controlled by PB2
AT91C_PB2_SPI1_SPCK       EQU (AT91C_PIO_PB2) ;-  SPI 1 Serial Clock
AT91C_PB2_TIOA4           EQU (AT91C_PIO_PB2) ;-  Timer Counter 4 Multipurpose Timer I/O Pin A
AT91C_PIO_PB20            EQU (1 << 20) ;- Pin Controlled by PB20
AT91C_PB20_RK0            EQU (AT91C_PIO_PB20) ;-  SSC0 Receive Clock
AT91C_PB20_ISI_D0         EQU (AT91C_PIO_PB20) ;-  Image Sensor Data 0
AT91C_PIO_PB21            EQU (1 << 21) ;- Pin Controlled by PB21
AT91C_PB21_RF0            EQU (AT91C_PIO_PB21) ;-  SSC0 Receive Frame Sync
AT91C_PB21_ISI_D1         EQU (AT91C_PIO_PB21) ;-  Image Sensor Data 1
AT91C_PIO_PB22            EQU (1 << 22) ;- Pin Controlled by PB22
AT91C_PB22_DSR0           EQU (AT91C_PIO_PB22) ;-  USART 0 Data Set ready
AT91C_PB22_ISI_D2         EQU (AT91C_PIO_PB22) ;-  Image Sensor Data 2
AT91C_PIO_PB23            EQU (1 << 23) ;- Pin Controlled by PB23
AT91C_PB23_DCD0           EQU (AT91C_PIO_PB23) ;-  USART 0 Data Carrier Detect
AT91C_PB23_ISI_D3         EQU (AT91C_PIO_PB23) ;-  Image Sensor Data 3
AT91C_PIO_PB24            EQU (1 << 24) ;- Pin Controlled by PB24
AT91C_PB24_DTR0           EQU (AT91C_PIO_PB24) ;-  USART 0 Data Terminal ready
AT91C_PB24_ISI_D4         EQU (AT91C_PIO_PB24) ;-  Image Sensor Data 4
AT91C_PIO_PB25            EQU (1 << 25) ;- Pin Controlled by PB25
AT91C_PB25_RI0            EQU (AT91C_PIO_PB25) ;-  USART 0 Ring Indicator
AT91C_PB25_ISI_D5         EQU (AT91C_PIO_PB25) ;-  Image Sensor Data 5
AT91C_PIO_PB26            EQU (1 << 26) ;- Pin Controlled by PB26
AT91C_PB26_RTS0           EQU (AT91C_PIO_PB26) ;-  USART 0 Ready To Send
AT91C_PB26_ISI_D6         EQU (AT91C_PIO_PB26) ;-  Image Sensor Data 6
AT91C_PIO_PB27            EQU (1 << 27) ;- Pin Controlled by PB27
AT91C_PB27_CTS0           EQU (AT91C_PIO_PB27) ;-  USART 0 Clear To Send
AT91C_PB27_ISI_D7         EQU (AT91C_PIO_PB27) ;-  Image Sensor Data 7
AT91C_PIO_PB28            EQU (1 << 28) ;- Pin Controlled by PB28
AT91C_PB28_RTS1           EQU (AT91C_PIO_PB28) ;-  USART 1 Ready To Send
AT91C_PB28_ISI_PCK        EQU (AT91C_PIO_PB28) ;-  Image Sensor Data Clock
AT91C_PIO_PB29            EQU (1 << 29) ;- Pin Controlled by PB29
AT91C_PB29_CTS1           EQU (AT91C_PIO_PB29) ;-  USART 1 Clear To Send
AT91C_PB29_ISI_VSYNC      EQU (AT91C_PIO_PB29) ;-  Image Sensor Vertical Synchro
AT91C_PIO_PB3             EQU (1 <<  3) ;- Pin Controlled by PB3
AT91C_PB3_SPI1_NPCS0      EQU (AT91C_PIO_PB3) ;-  SPI 1 Peripheral Chip Select 0
AT91C_PB3_TIOA5           EQU (AT91C_PIO_PB3) ;-  Timer Counter 5 Multipurpose Timer I/O Pin A
AT91C_PIO_PB30            EQU (1 << 30) ;- Pin Controlled by PB30
AT91C_PB30_PCK0_0         EQU (AT91C_PIO_PB30) ;-  PMC Programmable Clock Output 0
AT91C_PB30_ISI_HSYNC      EQU (AT91C_PIO_PB30) ;-  Image Sensor Horizontal Synchro
AT91C_PIO_PB31            EQU (1 << 31) ;- Pin Controlled by PB31
AT91C_PB31_PCK1_0         EQU (AT91C_PIO_PB31) ;-  PMC Programmable Clock Output 1
AT91C_PB31_ISI_MCK        EQU (AT91C_PIO_PB31) ;-  Image Sensor Reference Clock
AT91C_PIO_PB4             EQU (1 <<  4) ;- Pin Controlled by PB4
AT91C_PB4_TXD0            EQU (AT91C_PIO_PB4) ;-  USART 0 Transmit Data
AT91C_PIO_PB5             EQU (1 <<  5) ;- Pin Controlled by PB5
AT91C_PB5_RXD0            EQU (AT91C_PIO_PB5) ;-  USART 0 Receive Data
AT91C_PIO_PB6             EQU (1 <<  6) ;- Pin Controlled by PB6
AT91C_PB6_TXD1            EQU (AT91C_PIO_PB6) ;-  USART 1 Transmit Data
AT91C_PB6_TCLK1           EQU (AT91C_PIO_PB6) ;-  Timer Counter 1 external clock input
AT91C_PIO_PB7             EQU (1 <<  7) ;- Pin Controlled by PB7
AT91C_PB7_RXD1            EQU (AT91C_PIO_PB7) ;-  USART 1 Receive Data
AT91C_PB7_TCLK2           EQU (AT91C_PIO_PB7) ;-  Timer Counter 2 external clock input
AT91C_PIO_PB8             EQU (1 <<  8) ;- Pin Controlled by PB8
AT91C_PB8_TXD2            EQU (AT91C_PIO_PB8) ;-  USART 2 Transmit Data
AT91C_PIO_PB9             EQU (1 <<  9) ;- Pin Controlled by PB9
AT91C_PB9_RXD2            EQU (AT91C_PIO_PB9) ;-  USART 2 Receive Data
AT91C_PIO_PC0             EQU (1 <<  0) ;- Pin Controlled by PC0
AT91C_PC0_AD0             EQU (AT91C_PIO_PC0) ;-  ADC Analog Input 0
AT91C_PC0_SCK3            EQU (AT91C_PIO_PC0) ;-  USART 3 Serial Clock
AT91C_PIO_PC1             EQU (1 <<  1) ;- Pin Controlled by PC1
AT91C_PC1_AD1             EQU (AT91C_PIO_PC1) ;-  ADC Analog Input 1
AT91C_PC1_PCK0_1          EQU (AT91C_PIO_PC1) ;-  PMC Programmable Clock Output 0
AT91C_PIO_PC10            EQU (1 << 10) ;- Pin Controlled by PC10
AT91C_PC10_A25_CFRNW      EQU (AT91C_PIO_PC10) ;-  Address Bus[25]
AT91C_PC10_CTS3           EQU (AT91C_PIO_PC10) ;-  USART 3 Clear To Send
AT91C_PIO_PC11            EQU (1 << 11) ;- Pin Controlled by PC11
AT91C_PC11_NCS2           EQU (AT91C_PIO_PC11) ;-  Chip Select Line 2
AT91C_PC11_SPI0_NPCS1     EQU (AT91C_PIO_PC11) ;-  SPI 0 Peripheral Chip Select 1
AT91C_PIO_PC12            EQU (1 << 12) ;- Pin Controlled by PC12
AT91C_PC12_IRQ0           EQU (AT91C_PIO_PC12) ;-  External Interrupt 0
AT91C_PC12_NCS7           EQU (AT91C_PIO_PC12) ;-  Chip Select Line 7
AT91C_PIO_PC13            EQU (1 << 13) ;- Pin Controlled by PC13
AT91C_PC13_FIQ            EQU (AT91C_PIO_PC13) ;-  AIC Fast Interrupt Input
AT91C_PC13_NCS6           EQU (AT91C_PIO_PC13) ;-  Chip Select Line 6
AT91C_PIO_PC14            EQU (1 << 14) ;- Pin Controlled by PC14
AT91C_PC14_NCS3_NANDCS    EQU (AT91C_PIO_PC14) ;-  Chip Select Line 3
AT91C_PC14_IRQ2           EQU (AT91C_PIO_PC14) ;-  External Interrupt 2
AT91C_PIO_PC15            EQU (1 << 15) ;- Pin Controlled by PC15
AT91C_PC15_NWAIT          EQU (AT91C_PIO_PC15) ;-  External Wait Signal
AT91C_PC15_IRQ1           EQU (AT91C_PIO_PC15) ;-  External Interrupt 1
AT91C_PIO_PC16            EQU (1 << 16) ;- Pin Controlled by PC16
AT91C_PC16_D16            EQU (AT91C_PIO_PC16) ;-  Data Bus[16]
AT91C_PC16_SPI0_NPCS2     EQU (AT91C_PIO_PC16) ;-  SPI 0 Peripheral Chip Select 2
AT91C_PIO_PC17            EQU (1 << 17) ;- Pin Controlled by PC17
AT91C_PC17_D17            EQU (AT91C_PIO_PC17) ;-  Data Bus[17]
AT91C_PC17_SPI0_NPCS3     EQU (AT91C_PIO_PC17) ;-  SPI 0 Peripheral Chip Select 3
AT91C_PIO_PC18            EQU (1 << 18) ;- Pin Controlled by PC18
AT91C_PC18_D18            EQU (AT91C_PIO_PC18) ;-  Data Bus[18]
AT91C_PC18_SPI1_NPCS1_1   EQU (AT91C_PIO_PC18) ;-  SPI 1 Peripheral Chip Select 1
AT91C_PIO_PC19            EQU (1 << 19) ;- Pin Controlled by PC19
AT91C_PC19_D19            EQU (AT91C_PIO_PC19) ;-  Data Bus[19]
AT91C_PC19_SPI1_NPCS2_1   EQU (AT91C_PIO_PC19) ;-  SPI 1 Peripheral Chip Select 2
AT91C_PIO_PC2             EQU (1 <<  2) ;- Pin Controlled by PC2
AT91C_PC2_AD2             EQU (AT91C_PIO_PC2) ;-  ADC Analog Input 2
AT91C_PC2_PCK1_1          EQU (AT91C_PIO_PC2) ;-  PMC Programmable Clock Output 1
AT91C_PIO_PC20            EQU (1 << 20) ;- Pin Controlled by PC20
AT91C_PC20_D20            EQU (AT91C_PIO_PC20) ;-  Data Bus[20]
AT91C_PC20_SPI1_NPCS3_1   EQU (AT91C_PIO_PC20) ;-  SPI 1 Peripheral Chip Select 3
AT91C_PIO_PC21            EQU (1 << 21) ;- Pin Controlled by PC21
AT91C_PC21_D21            EQU (AT91C_PIO_PC21) ;-  Data Bus[21]
AT91C_PC21_EF100          EQU (AT91C_PIO_PC21) ;-  Ethernet MAC Force 100 Mbits/sec
AT91C_PIO_PC22            EQU (1 << 22) ;- Pin Controlled by PC22
AT91C_PC22_D22            EQU (AT91C_PIO_PC22) ;-  Data Bus[22]
AT91C_PC22_TCLK5          EQU (AT91C_PIO_PC22) ;-  Timer Counter 5 external clock input
AT91C_PIO_PC23            EQU (1 << 23) ;- Pin Controlled by PC23
AT91C_PC23_D23            EQU (AT91C_PIO_PC23) ;-  Data Bus[23]
AT91C_PIO_PC24            EQU (1 << 24) ;- Pin Controlled by PC24
AT91C_PC24_D24            EQU (AT91C_PIO_PC24) ;-  Data Bus[24]
AT91C_PIO_PC25            EQU (1 << 25) ;- Pin Controlled by PC25
AT91C_PC25_D25            EQU (AT91C_PIO_PC25) ;-  Data Bus[25]
AT91C_PIO_PC26            EQU (1 << 26) ;- Pin Controlled by PC26
AT91C_PC26_D26            EQU (AT91C_PIO_PC26) ;-  Data Bus[26]
AT91C_PIO_PC27            EQU (1 << 27) ;- Pin Controlled by PC27
AT91C_PC27_D27            EQU (AT91C_PIO_PC27) ;-  Data Bus[27]
AT91C_PIO_PC28            EQU (1 << 28) ;- Pin Controlled by PC28
AT91C_PC28_D28            EQU (AT91C_PIO_PC28) ;-  Data Bus[28]
AT91C_PIO_PC29            EQU (1 << 29) ;- Pin Controlled by PC29
AT91C_PC29_D29            EQU (AT91C_PIO_PC29) ;-  Data Bus[29]
AT91C_PIO_PC3             EQU (1 <<  3) ;- Pin Controlled by PC3
AT91C_PC3_AD3             EQU (AT91C_PIO_PC3) ;-  ADC Analog Input 3
AT91C_PC3_SPI1_NPCS3_0    EQU (AT91C_PIO_PC3) ;-  SPI 1 Peripheral Chip Select 3
AT91C_PIO_PC30            EQU (1 << 30) ;- Pin Controlled by PC30
AT91C_PC30_D30            EQU (AT91C_PIO_PC30) ;-  Data Bus[30]
AT91C_PIO_PC31            EQU (1 << 31) ;- Pin Controlled by PC31
AT91C_PC31_D31            EQU (AT91C_PIO_PC31) ;-  Data Bus[31]
AT91C_PIO_PC4             EQU (1 <<  4) ;- Pin Controlled by PC4
AT91C_PC4_A23             EQU (AT91C_PIO_PC4) ;-  Address Bus[23]
AT91C_PC4_SPI1_NPCS2_0    EQU (AT91C_PIO_PC4) ;-  SPI 1 Peripheral Chip Select 2
AT91C_PIO_PC5             EQU (1 <<  5) ;- Pin Controlled by PC5
AT91C_PC5_A24             EQU (AT91C_PIO_PC5) ;-  Address Bus[24]
AT91C_PC5_SPI1_NPCS1_0    EQU (AT91C_PIO_PC5) ;-  SPI 1 Peripheral Chip Select 1
AT91C_PIO_PC6             EQU (1 <<  6) ;- Pin Controlled by PC6
AT91C_PC6_TIOB2           EQU (AT91C_PIO_PC6) ;-  Timer Counter 2 Multipurpose Timer I/O Pin B
AT91C_PC6_CFCE1           EQU (AT91C_PIO_PC6) ;-  Compact Flash Enable 1
AT91C_PIO_PC7             EQU (1 <<  7) ;- Pin Controlled by PC7
AT91C_PC7_TIOB1           EQU (AT91C_PIO_PC7) ;-  Timer Counter 1 Multipurpose Timer I/O Pin B
AT91C_PC7_CFCE2           EQU (AT91C_PIO_PC7) ;-  Compact Flash Enable 2
AT91C_PIO_PC8             EQU (1 <<  8) ;- Pin Controlled by PC8
AT91C_PC8_NCS4_CFCS0      EQU (AT91C_PIO_PC8) ;-  Chip Select Line 4
AT91C_PC8_RTS3            EQU (AT91C_PIO_PC8) ;-  USART 3 Ready To Send
AT91C_PIO_PC9             EQU (1 <<  9) ;- Pin Controlled by PC9
AT91C_PC9_NCS5_CFCS1      EQU (AT91C_PIO_PC9) ;-  Chip Select Line 5
AT91C_PC9_TIOB0           EQU (AT91C_PIO_PC9) ;-  Timer Counter 0 Multipurpose Timer I/O Pin B

